# task1

# a = (int(input('Введите число:')))
# print (f'Тут бесконечность нолей')
# print (f'Тут {int(a/1)} единиц')
# print (f'Тут {int(a/2)} двоек')
# print (f'Тут {int(a/3)} троек')
# print (f'Тут {int(a/4)} четверок')
# print (f'Тут {int(a/5)} пятерок')
# print (f'Тут {int(a/6)} шестерок')
# print (f'Тут {int(a/7)} семерок')
# print (f'Тут {int(a/8)} восмерок')
# print (f'Тут {int(a/9)} девяток')

# task2
# print (9-int(input('Введите число:')))

# task3

# lst = [12, 3, 456, 78]
# print((' '.join(map(str, lst))).replace(' ', ''))

# task4

# a=int(input('Введите 1ое целое число:'))
# b=int(input('Введите 2ое целое число:'))
# c=int(input('Введите 3ое целое число:'))
#
# if b-c == a-b:
#     print ('Числа являются последовательными элементами арифметической последовательности')
# else :
#     print('Числа не являются последовательными элементами арифметической последовательности')

# task5

# num = int(input('Введите число от 1-го до 7-ми: '))
# if num == 1 :
#     print ('Понедельник')
# elif num == 2 :
#     print ('Вторник')
# elif num == 3 :
#     print ('Среда')
# elif num == 4 :
#     print ('Четверг')
# elif num == 5 :
#     print ('Пятница')
# elif num == 6 :
#     print ('Суббота')
# elif num == 7 :
#     print ('Воскресенье')
# else :
#     print ('Введите другое число')

#task6
# В условии вроде как ошибка поэтому я сломался и не понял

#task9

arr = [ [1, 2, 4, 29],
        [3, 4, 6, 1] ]
print (set(arr))